app/Console/Commands/ImportCampaignsCommand.php

select * from `users` where `username` = 0 limit 1
select count(*) as aggregate from `campaigns` where `code` = 'cbrevo#6'
---
    public function handle(): void
    {
        //
        $this->brevoService = new BrevoService();
        $notificationRepository = new NotificationRepository();

        if (!is_null($this->option('user'))) {
            $user = User::where('username', $this->option('user'))->firstOrFail();
            $user->firstname = decrypt_data($user->firstname);
            $user->lastname = decrypt_data($user->lastname);

            $notificationRepository->create("Importação de campanhas", "<strong>{$user->firstname} {$user->lastname}</strong> inicializou a importação de campanhas", $user->id);
        } else {
            $notificationRepository->create("Importação de campanhas", "O <strong>sistema</strong> inicializou a importação de campanhas automaticamente, pode <strong>continuar a utilizar a plataforma.</strong>", 0);
        }

        $this->info("\nImporting and updating campaigns...\n");

        $campaignsFromService = $this->brevoService->getAllCampaigns();

        foreach ($campaignsFromService as $campaign) {
            $selectedCampaignByCode = Campaign::where("code", "cbrevo#" . $campaign['id']);

            if ($selectedCampaignByCode->count() == 0) {