app/Http/Controllers/Api/DoctorApiController.php

select * from `users` where `username` = 'eduardo.bessa' limit 1
insert into `doctors` (`user_id`, `email`, `mobile`, `updated_at`, `created_at`) values (3, 'eduardo.bessa@dev.itscrm.local', '913 946 525', '2024-03-14 00:04:55', '2024-03-14 00:04:55')
---
    public function store(DoctorStoreRequest $request)
    {
        if(!$validated = $request->validated()){
            $request->session()->flash('message.body', "Por favor verifique todos os campos introduzidos");
            return back()->withInput()->withErrors($validated);
        }

        $user = User::where('username', $request->input('username'))->firstOrFail();

        $doctor = new Doctor();
        $doctor->user_id = $user->id;
        $doctor->email = $request->input('email');
        $doctor->mobile = $request->input('mobile');

        $specialties = json_decode($request->input('doctor-specialties'), true);

        if(!$doctor->save()){