app/Http/Livewire/Backoffice/Components/Customers/DoctorsComponent.php

    public function mount(string $customer = null): void
    {
        if(!is_null($customer)){
            $this->customer = Customer::where('slug', $customer)->firstOrFail();
---
select * from `customers` where `slug` = '051907000-1701189216' limit 1

    public function render(): Factory|View|Application
    {

        $this->specialities = Speciality::all();
---
select * from `specialities`