app/Http/Livewire/Backoffice/Components/Customers/InformationComponent.php

select * from `customers` where `slug` = '051907000-1701189216' limit 1
---
    public function mount(string $customer = null): void
    {
        if(!is_null($this->customer)) {
            $this->customer = Customer::where('slug', $customer)->firstOrFail();