app/Http/Livewire/Backoffice/Components/Customers/TagsComponent.php

    public function mount($customer = null): void
    {
        if(!is_null($customer)) {
            $this->customer = Customer::with('tags')->where('slug', $customer)->first();
---
select * from `customers` where `slug` = '051907000-1701189216' limit 1
select `tags`.*, `tag_customer`.`customer_id` as `pivot_customer_id`, `tag_customer`.`tag_id` as `pivot_tag_id` from `tags` inner join `tag_customer` on `tags`.`id` = `tag_customer`.`tag_id` where `tag_customer`.`customer_id` in (1)

    public function addOrCreate(string $slug = null): void
    {
        // TODO: Create relationship if not exists tag, create a tag and create relationship
        if(!is_null($slug)) {
            $this->customer->tags()->attach(Tag::where('slug', $slug)->first()->id);
        }else{

            $this->customer->tags()->create([
                'name' => $this->value,
                'slug' => uniqid()
            ]);
---
insert into `tag_customer` (`customer_id`, `tag_id`) values (1, 2)
select * from `tags` where `slug` = '65807ea7e11c6' limit 1
select * from `tags`
insert into `tags` (`name`, `slug`) values ('Aniversário', '65808526b46a9')

    public function findAndRemove($selected): void
    {
        $this->customer->tags()->detach($selected);
---
delete from `tag_customer` where `tag_customer`.`customer_id` = 1 and `tag_customer`.`tag_id` in ('2')

    public function render(): Application|View|Factory
    {
        $this->tags = $this->customer->tags;

        return view('livewire.backoffice.components.customers.tags-component')
            ->with(['campaigns' => Campaign::all()]);
---
select * from `campaigns`