app/Http/Livewire/Backoffice/Components/Customers/UploadImageComponent.php

select * from `customers` where `slug` = '051907000-1701189216' limit 1
select * from `avatars` where `avatars`.`id` = 1 and `avatars`.`id` is not null limit 1
---
    public function mount(string $customer = null): void
    {
        if(!is_null($customer)) {
            $this->customer = Customer::where('slug', $customer)->firstOrFail();
            $this->avatar = $this->customer->avatar;
        }

        if(is_null($this->avatar)) {
            $this->avatar = Avatar::first();