app/Livewire/Backoffice/Components/Customers/UploadImageComponent.php

    public function mount(string $customer = null): void
    {
        if(!is_null($customer)) {
            $this->customer = Customer::where('slug', $customer)->firstOrFail();
            $this->avatar = $this->customer->avatar;
        }

        if(is_null($this->avatar)) {
            $this->avatar = Avatar::first();
---
select * from `avatars` limit 1