app/Livewire/Backoffice/Components/Tags/AddTagsComponent.php

    public function render(): View|\Illuminate\Foundation\Application|Factory|Application
    {
        // TODO: Resolve "Attempt to read property "tags" on null
        $this->tags = Tag::all();
//        $this->tags = $this->customer->tags;

        return view('livewire.backoffice.components.customers.tags-component')
            ->with(['campaigns' => Campaign::all()]);
---
select * from `tags`
select * from `campaigns`