app/Http/Controllers/Views/CustomerViewController.php

select * from `customers` where `slug` = '051907000-1701189216' limit 1
select `tags`.*, `tag_customer`.`customer_id` as `pivot_customer_id`, `tag_customer`.`tag_id` as `pivot_tag_id` from `tags` inner join `tag_customer` on `tags`.`id` = `tag_customer`.`tag_id` where `tag_customer`.`customer_id` in (1)
---
    public function edit(string $slug)
    {
        //
        $customer = Customer::with('tags')->where('slug', $slug)->firstOrFail();