app/Http/Controllers/Views/PageStaticViewController.php

select count(*) as aggregate from `customers` where DATE_FORMAT(birthday, '%m-%d') BETWEEN '03-12' AND '03-19'
select count(*) as aggregate from `campaigns`
select count(*) as aggregate from `messages`
select count(*) as aggregate from `doctors`
select count(*) as aggregate from `customers` where DATE_FORMAT(birthday, '%m-%d') BETWEEN '12-18' AND '12-25'
---
    public function home()
    {

        $today = now()->format('m-d');
        $nextWeek = now()->addWeek()->format('m-d');
        $customers = Customer::count();

        $campaigns = Campaign::count();
        $messages = Message::count();
        $doctors = Doctor::count() . ", 10";
        //$birthdays = Customer::whereRaw("DATE_FORMAT(birthday, '%m-%d') BETWEEN {$today} AND {$nextWeek}")->paginate(5);
        $birthdays = Customer::whereRaw("DATE_FORMAT(birthday, '%m-%d') BETWEEN '{$today}' AND '{$nextWeek}'")->paginate(5);