app/Livewire/Backoffice/Components/Doctors/InformationComponent.php

    public function changeSelectUsername(): void
    {

        $this->user = User::with('doctor')->where('username', $this->username)->first();
---
select * from `doctors` where `doctors`.`user_id` in (3)
select * from `users` where `username` = 'eduardo.bessa' limit 1

    public function emailChangeEventHandler(): void
    {
        $user = User::where('email', $this->email)->count();
---
select count(*) as aggregate from `users` where `email` = 'eduardo.bessa@localhost'

    public function render(): View|\Illuminate\Foundation\Application|Factory|Application
    {

        $users = User::where('status', UserInterface::STATUS_ACTIVE)
            ->whereDoesntHave('doctor')
            ->get();
---
select * from `users` where `status` = 'USER::STATUS::ACTIVE' and not exists (select * from `doctors` where `users`.`id` = `doctors`.`user_id`)