app/Livewire/Backoffice/Components/Doctors/SpecialtiesComponent.php

    public function specialtyAddEvent(): void
    {
        $specialty = Specialty::where('slug', $this->selected)->firstOrFail();
---
select * from `specialties` where `slug` = 'nova-especialidade090585400-1707582178' limit 1

    public function render(): View|\Illuminate\Foundation\Application|Factory|Application
    {
        $this->specialties = Specialty::all();
---
select * from `specialties`