app/Http/Controllers/Views/Auth/SignUpViewController.php

    public function activationAccount(Request $request, $token): RedirectResponse
    {
        $activation_account = $this->activationAccountRepository->WhereTokenIs($token);

        if($activation_account->status !== ActivationAccountInterface::STATUS_ACTIVE) {
            return redirect()->route('auth.sign-in')->with('error', 'Activation account link is expired.');
        }

        // Activate account and change status to used
        $user = User::find($activation_account->user_id);
        $user->status = UserInterface::STATUS_ACTIVE;
        $user->save();

        // Change status to used
        $activation_account->status = ActivationAccountInterface::STATUS_USED;
        $activation_account->save();
---
select * from `users` where `users`.`id` = 3 limit 1
update `users` set `status` = 'USER::STATUS::ACTIVE', `users`.`updated_at` = '2024-03-13 23:32:51' where `id` = 3
update `activation_accounts` set `status` = 'ACTIVATION_ACCOUNT::STATUS::USED', `activation_accounts`.`updated_at` = '2024-03-13 23:32:52' where `id` = 3