app/Livewire/Backoffice/AppCustomersComponent.php

    public function render()
    {
        $customersCount = Customer::count();
        $customers = Customer::with('tags')
            ->where('name', 'like', '%' . $this->search . '%')
            ->paginate(30);
---
select count(*) as aggregate from `customers`
select count(*) as aggregate from `customers` where `name` like '%%'