app/Livewire/Backoffice/AppCampaignsComponent.php

delete from `campaigns` where `id` = 6
select * from `campaigns` where `campaigns`.`id` = 6 limit 1
---
    public function deleteClickEventHandler(int $id): void
    {
        Campaign::find($id)->delete();

select * from `campaigns`
---
    public function mount(): void
    {
        $this->campaigns = Campaign::all();