app/Livewire/Backoffice/AppDoctorsComponent.php

    public function render(): View|Factory|Application
    {

        $doctors_counter = Doctor::count();
        $doctors  = Doctor::with(['user', 'Specialities'])->paginate(30);
---
select count(*) as aggregate from `doctors`
select * from `doctors` limit 30 offset 0
select * from `users` where `users`.`id` in (3)