app/Livewire/Backoffice/AppSpecialtiesComponent.php

    public function render(): View|\Illuminate\Foundation\Application|Factory|Application
    {
        $specialties_counter = Specialty::count();
        $specialties = Specialty::all();
---
select count(*) as aggregate from `specialties`
select * from `specialties`