app/Http/Livewire/Backoffice/AppCustomersComponent.php

select count(*) as aggregate from `customers`
select * from `customers` where `name` like '%%' limit 30 offset 0
select `tags`.*, `tag_customer`.`customer_id` as `pivot_customer_id`, `tag_customer`.`tag_id` as `pivot_tag_id` from `tags` inner join `tag_customer` on `tags`.`id` = `tag_customer`.`tag_id` where `tag_customer`.`customer_id` in (1, 2, 3)
select count(*) as aggregate from `customers` where `name` like '%%'
---
    public function render()
    {
        $customersCount = Customer::count();
        $customers = Customer::with('tags')
            ->where('name', 'like', '%' . $this->search . '%')
            ->paginate(30);